# Unpivot이란?
* wide 타입의 데이터를 long 타입으로 변환하는 과정
    * long 타입 데이터 ----  pivot  ---> wide 타입 데이터
    * wide 타입 데이터 ---- unpivot ---> long 타입 데이터  
     stack() 함수를 활용
## 언제 Unpivot을 할까요?
* 수집한 데이터 소스가 wide 타입 데이터 인 경우 (예: 데이터베이스에서 분석용 테이블을 만들어 export 한 경우)
* 추가적인 데이터 변경에 대한 요구사항이 있을 경우 wide 타입 데이터는 분석용 데이터이기 때문에 raw 형태의 데이터를 만들어  
 새로운 분석 데이터를 만들고자 할때

# 멀티인덱스인 경우 unpivot

In [1]:
import pandas as pd

In [2]:
val = [[83, 93, 99], [77, 88, 91], [92, 78, 95]]
idx = ["권보아", "김범수", "박효신"]
wide_df = pd.DataFrame(val, index=idx, columns=["국어", "수학", "과학"])
wide_df

     국어  수학  과학
권보아  83  93  99
김범수  77  88  91
박효신  92  78  95

In [3]:
wide_df.stack() # 멀티인덱스의 시리즈로 반환

권보아  국어    83
     수학    93
     과학    99
김범수  국어    77
     수학    88
     과학    91
박효신  국어    92
     수학    78
     과학    95
dtype: int64

* Step1] 멀티 인덴스를 열로 전환(열의 이름은 level_0, level_1, ... 이렇게 자동생성)

In [5]:
long_df = wide_df.stack().reset_index()
long_df

  level_0 level_1   0
0     권보아      국어  83
1     권보아      수학  93
2     권보아      과학  99
3     김범수      국어  77
4     김범수      수학  88
5     김범수      과학  91
6     박효신      국어  92
7     박효신      수학  78
8     박효신      과학  95

* Step2] 열이름 재 할당

In [9]:
long_df.columns = ['학생이름','과목','점수']
long_df

  학생이름  과목  점수
0  권보아  국어  83
1  권보아  수학  93
2  권보아  과학  99
3  김범수  국어  77
4  김범수  수학  88
5  김범수  과학  91
6  박효신  국어  92
7  박효신  수학  78
8  박효신  과학  95

* Step3] 신규 데이터 추가

In [24]:
new_data = { '학생이름':['서동준', '서동준','서동준'], '과목':['국어', '수학', '과학'], '점수':[90,70,75] }
new_data

{'학생이름': ['서동준', '서동준', '서동준'], '과목': ['국어', '수학', '과학'], '점수': [90, 70, 75]}

In [27]:
new_rows = pd.DataFrame(new_data)
new_rows

  학생이름  과목  점수
0  서동준  국어  90
1  서동준  수학  70
2  서동준  과학  75

In [29]:
new_long_df = pd.concat([long_df, new_rows],ignore_index=True)
new_long_df

   학생이름  과목  점수
0   권보아  국어  83
1   권보아  수학  93
2   권보아  과학  99
3   김범수  국어  77
4   김범수  수학  88
5   김범수  과학  91
6   박효신  국어  92
7   박효신  수학  78
8   박효신  과학  95
9   서동준  국어  90
10  서동준  수학  70
11  서동준  과학  75

* Step4] 재분석

In [20]:
w_df2 = long_df.pivot(values='점수', index='학생이름', columns='과목')
w_df2

과목    과학  국어  수학
학생이름
권보아   99  83  93
김범수   91  77  88
박효신   95  92  78